In [519]:
import pandas as pd
data=pd.read_csv('loanpredictions.csv')
# display top5 row of dataset
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
0,LP001002,Male,No,0,Graduate,No,0.0,360.0,Urban,Y,9.0,54017,97735
1,LP001003,Male,Yes,1,Graduate,No,1508.0,360.0,Rural,N,7.0,18693,59767
2,LP001005,Male,Yes,0,Graduate,Yes,0.0,360.0,Urban,Y,10.0,59093,177736
3,LP001006,Male,Yes,0,Not Graduate,No,2358.0,360.0,Urban,Y,6.0,93170,174406
4,LP001008,Male,No,0,Graduate,No,0.0,360.0,Urban,Y,5.0,71391,129734

In [520]:
# check last 5 row of datasets
data.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
609,LP002757,Female,Yes,0,Not Graduate,No,663.0,360.0,Semiurban,Y,6.0,79371,121332
610,LP002794,Female,No,0,Graduate,No,1625.0,360.0,Urban,Y,7.0,74448,68862
611,LP002833,Male,Yes,0,Not Graduate,No,0.0,360.0,Rural,Y,5.0,71093,80908
612,LP002898,Male,Yes,1,Graduate,No,0.0,360.0,Rural,N,1.0,31242,193249
613,LP002949,Female,No,3+,Graduate,NaN,41667.0,180.0,Urban,N,NaN,59435,82739

In [521]:
# Find shape of our dataset(number of row and number of columns
# shape is not a method it is a attribute
data.shape

(614, 13)

In [522]:
print("number of rows",data.shape[0])
print("number of columns",data.shape[1])

number of rows 614
number of columns 13

In [523]:
# Get inforamtion about our dataset liketotal number rows total number of columns ,datatypes of each column and memory requirement
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   CoapplicantIncome  614 non-null    float64
 7   Loan_Amount_Term   600 non-null    float64
 8   Property_Area      614 non-null    object
 9   Loan_Status        614 non-null    object
 10  Credit_History     613 non-null    float64
 11  ApplicantIncome    614 non-null    int64
 12  LoanAmount         614 non-null    int64
dtypes: float64(3), int64(2), object(8)
memory usage: 62.5+ KB

In [524]:
# check null values in dataset
data.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
CoapplicantIncome     0
Loan_Amount_Term     14
Property_Area         0
Loan_Status           0
Credit_History        1
ApplicantIncome       0
LoanAmount            0
dtype: int64

In [525]:
# check null value in dataset
data.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
CoapplicantIncome     0
Loan_Amount_Term     14
Property_Area         0
Loan_Status           0
Credit_History        1
ApplicantIncome       0
LoanAmount            0
dtype: int64

In [526]:
data.isnull().sum()*100/len(data)

Loan_ID              0.000000
Gender               2.117264
Married              0.488599
Dependents           2.442997
Education            0.000000
Self_Employed        5.211726
CoapplicantIncome    0.000000
Loan_Amount_Term     2.280130
Property_Area        0.000000
Loan_Status          0.000000
Credit_History       0.162866
ApplicantIncome      0.000000
LoanAmount           0.000000
dtype: float64

In [527]:
data = data.drop('Loan_ID', axis=1, errors='ignore')
data.head(1)

,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
0,Male,No,0,Graduate,No,0.0,360.0,Urban,Y,9.0,54017,97735

In [528]:
columns=['Gender','Dependents','Married','Loan_Amount_Term','Credit_History']

In [529]:
data=data.dropna(subset=columns)

In [530]:
data.isnull().sum()*100/len(data)

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        5.244755
CoapplicantIncome    0.000000
Loan_Amount_Term     0.000000
Property_Area        0.000000
Loan_Status          0.000000
Credit_History       0.000000
ApplicantIncome      0.000000
LoanAmount           0.000000
dtype: float64

In [531]:
data.isnull().sum()*100/len(data)

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        5.244755
CoapplicantIncome    0.000000
Loan_Amount_Term     0.000000
Property_Area        0.000000
Loan_Status          0.000000
Credit_History       0.000000
ApplicantIncome      0.000000
LoanAmount           0.000000
dtype: float64

In [532]:
# Handling categorical column
data.sample(5)

,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
352,Male,Yes,0,Graduate,NaN,1376.0,360.0,Rural,N,7.0,30645,141082
386,Male,Yes,1,Graduate,Yes,0.0,360.0,Semiurban,Y,9.0,67445,86424
324,Male,Yes,0,Not Graduate,No,2033.0,360.0,Rural,Y,5.0,73183,171014
184,Female,No,0,Graduate,No,0.0,360.0,Semiurban,Y,5.0,52630,122488
99,Male,No,0,Graduate,No,1640.0,360.0,Rural,Y,9.0,56772,132936

In [533]:
data.sample(5)

,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
153,Male,No,0,Graduate,Yes,3750.0,360.0,Rural,Y,9.0,71895,58511
119,Male,No,0,Graduate,No,0.0,360.0,Urban,N,6.0,13735,129736
38,Female,No,0,Graduate,Yes,2275.0,360.0,Semiurban,Y,8.0,89762,133961
201,Male,Yes,1,Not Graduate,No,7101.0,180.0,Semiurban,Y,5.0,88425,85043
272,Male,Yes,3+,Not Graduate,No,0.0,360.0,Semiurban,Y,10.0,40963,102976

In [534]:
data['Dependents'].unique()

array(['0', '1', '2', '3+'], dtype=object)

In [535]:
data['Dependents']=data['Dependents'].replace(to_replace="3+",value="4")

In [536]:
data['Dependents'].unique()

array(['0', '1', '2', '4'], dtype=object)

In [537]:
data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [538]:
data['Gender']=data['Gender'].map({'Male':1,'Female':0}).astype('int')

In [539]:
data.isnull().sum()*100/len(data)

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        5.244755
CoapplicantIncome    0.000000
Loan_Amount_Term     0.000000
Property_Area        0.000000
Loan_Status          0.000000
Credit_History       0.000000
ApplicantIncome      0.000000
LoanAmount           0.000000
dtype: float64

In [540]:
data['Self_Employed']=data['Self_Employed'].fillna(data['Self_Employed'].mode()[0])

In [541]:
data.isnull().sum()*100/len(data)

Gender               0.0
Married              0.0
Dependents           0.0
Education            0.0
Self_Employed        0.0
CoapplicantIncome    0.0
Loan_Amount_Term     0.0
Property_Area        0.0
Loan_Status          0.0
Credit_History       0.0
ApplicantIncome      0.0
LoanAmount           0.0
dtype: float64

In [542]:
data['Credit_History'].unique()

array([ 9.,  7., 10.,  6.,  5.,  8.,  1.,  2.,  3.,  0.,  4.])

In [543]:
data['Credit_History'].fillna(data['Credit_History'].mode()[0])

0       9.0
1       7.0
2      10.0
3       6.0
4       5.0
       ...
608     3.0
609     6.0
610     7.0
611     5.0
612     1.0
Name: Credit_History, Length: 572, dtype: float64

In [544]:
data.isnull().sum()*100/len(data)

Gender               0.0
Married              0.0
Dependents           0.0
Education            0.0
Self_Employed        0.0
CoapplicantIncome    0.0
Loan_Amount_Term     0.0
Property_Area        0.0
Loan_Status          0.0
Credit_History       0.0
ApplicantIncome      0.0
LoanAmount           0.0
dtype: float64

In [545]:
data['Married']=data['Married'].map({'Yes':1,'No':0}).astype('int')

In [546]:
data['Self_Employed']=data['Self_Employed'].map({'Yes':1,'No':0}).astype('int')

In [547]:
print(data.columns)
print(data.head())

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'CoapplicantIncome', 'Loan_Amount_Term', 'Property_Area', 'Loan_Status',
       'Credit_History', 'ApplicantIncome', 'LoanAmount'],
      dtype='object')
   Gender  Married Dependents     Education  Self_Employed  CoapplicantIncome  \
0       1        0          0      Graduate              0                0.0
1       1        1          1      Graduate              0             1508.0
2       1        1          0      Graduate              1                0.0
3       1        1          0  Not Graduate              0             2358.0
4       1        0          0      Graduate              0                0.0

   Loan_Amount_Term Property_Area Loan_Status  Credit_History  \
0             360.0         Urban           Y             9.0
1             360.0         Rural           N             7.0
2             360.0         Urban           Y            10.0
3             360.0         Urban           Y             6.0
4             360.0         Urban           Y             5.0

   ApplicantIncome  LoanAmount
0            54017       97735
1            18693       59767
2            59093      177736
3            93170      174406
4            71391      129734

In [548]:
data['Property_Area']=data['Property_Area'].map({'Rural':1,'Semiurban':2,'Urban':1}).astype('int')
data['Loan_Status']=data['Loan_Status'].map({'Y':1,'N':0}).astype('int')

In [549]:
print(data['Gender'].head())

0    1
1    1
2    1
3    1
4    1
Name: Gender, dtype: int32

In [550]:
valid_genders = ['Male', 'Female']
data = data[~data['Gender'].isin(valid_genders)]

In [551]:
nan_mask = data['Gender'].isna()
num_nan_values = nan_mask.sum()
print("Number of NaN values in 'Gender' column:", num_nan_values)
print(data[nan_mask])

Number of NaN values in 'Gender' column: 0
Empty DataFrame
Columns: [Gender, Married, Dependents, Education, Self_Employed, CoapplicantIncome, Loan_Amount_Term, Property_Area, Loan_Status, Credit_History, ApplicantIncome, LoanAmount]
Index: []

In [552]:
unique_values = data['Gender'].unique()
print("Unique values in 'Gender' column:", unique_values)

Unique values in 'Gender' column: [1 0]

In [553]:
data['Gender'].unique()

array([1, 0])

In [554]:
data['Gender'] = data['Gender'].map({1: 1, 0: 0}).astype(int)

In [555]:
data.head()

,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
0,1,0,0,Graduate,0,0.0,360.0,1,1,9.0,54017,97735
1,1,1,1,Graduate,0,1508.0,360.0,1,0,7.0,18693,59767
2,1,1,0,Graduate,1,0.0,360.0,1,1,10.0,59093,177736
3,1,1,0,Not Graduate,0,2358.0,360.0,1,1,6.0,93170,174406
4,1,0,0,Graduate,0,0.0,360.0,1,1,5.0,71391,129734

In [556]:
data.tail()

,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
608,1,0,1,Graduate,0,0.0,360.0,2,0,3.0,46806,195166
609,0,1,0,Not Graduate,0,663.0,360.0,2,1,6.0,79371,121332
610,0,0,0,Graduate,0,1625.0,360.0,1,1,7.0,74448,68862
611,1,1,0,Not Graduate,0,0.0,360.0,1,1,5.0,71093,80908
612,1,1,1,Graduate,0,0.0,360.0,1,0,1.0,31242,193249

In [557]:
print(data.columns)
print(data.head())

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'CoapplicantIncome', 'Loan_Amount_Term', 'Property_Area', 'Loan_Status',
       'Credit_History', 'ApplicantIncome', 'LoanAmount'],
      dtype='object')
   Gender  Married Dependents     Education  Self_Employed  CoapplicantIncome  \
0       1        0          0      Graduate              0                0.0
1       1        1          1      Graduate              0             1508.0
2       1        1          0      Graduate              1                0.0
3       1        1          0  Not Graduate              0             2358.0
4       1        0          0      Graduate              0                0.0

   Loan_Amount_Term  Property_Area  Loan_Status  Credit_History  \
0             360.0              1            1             9.0
1             360.0              1            0             7.0
2             360.0              1            1            10.0
3             360.0              1            1             6.0
4             360.0              1            1             5.0

   ApplicantIncome  LoanAmount
0            54017       97735
1            18693       59767
2            59093      177736
3            93170      174406
4            71391      129734

In [558]:
for column in data.columns:
    print(column)

Gender
Married
Dependents
Education
Self_Employed
CoapplicantIncome
Loan_Amount_Term
Property_Area
Loan_Status
Credit_History
ApplicantIncome
LoanAmount

In [559]:
X=data.drop('Loan_Status',axis=1)

In [560]:
y = data['Loan_Status']

In [561]:
data['Education'] = data['Education'].fillna('Unknown')

In [562]:
nan_mask = data['Education'].isna()
num_nan_values = nan_mask.sum()
print("Number of NaN values in 'Education' column:", num_nan_values)
print(data[nan_mask])

Number of NaN values in 'Education' column: 0
Empty DataFrame
Columns: [Gender, Married, Dependents, Education, Self_Employed, CoapplicantIncome, Loan_Amount_Term, Property_Area, Loan_Status, Credit_History, ApplicantIncome, LoanAmount]
Index: []

In [570]:
data['Education'] = data['Education'].fillna('Unknown')

In [571]:
unexpected_values = data[~data['Education'].isin(['Graduate', 'Not Graduate', 'Unknown'])]['Education']
print("Unexpected values in 'Education' column:", unexpected_values.unique())

Unexpected values in 'Education' column: [1 0]

In [573]:
data['Education'] = data['Education'].map({'Graduate': 1, 'Not Graduate': 0, 'Unknown': -1}).astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [ ]:
# Fetire scaling (allow to put feature in same scale) essental for machine learning to calculate distances between data if not scale  the feature with high value range statrt dominating while caculate  distances/
data.head()

,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Loan_Status,Credit_History,ApplicantIncome,LoanAmount
0,1,0,0,1,0,0.0,360.0,1,1,9.0,54017,97735
1,1,1,1,1,0,1508.0,360.0,1,0,7.0,18693,59767
2,1,1,0,1,1,0.0,360.0,1,1,10.0,59093,177736
3,1,1,0,0,0,2358.0,360.0,1,1,6.0,93170,174406
4,1,0,0,1,0,0.0,360.0,1,1,5.0,71391,129734

In [ ]:
cols=['CoapplicantIncome','ApplicantIncome','LoanAmount','Loan_Amount_Term']

In [ ]:
from sklearn.preprocessing import StandardScaler
st=StandardScaler()
X[cols]=st.fit_transform(X[cols])
X

,Gender,Married,Dependents,Education,Self_Employed,CoapplicantIncome,Loan_Amount_Term,Property_Area,Credit_History,ApplicantIncome,LoanAmount
0,1,0,0,Graduate,0,-0.631025,0.27828,1,9.0,-0.202753,-0.537455
1,1,1,1,Graduate,0,-0.025453,0.27828,1,7.0,-1.776177,-1.447166
2,1,1,0,Graduate,1,-0.631025,0.27828,1,10.0,0.023345,1.379364
3,1,1,0,Not Graduate,0,0.315883,0.27828,1,6.0,1.541224,1.299578
4,1,0,0,Graduate,0,-0.631025,0.27828,1,5.0,0.571130,0.229239
...,...,...,...,...,...,...,...,...,...,...,...
608,1,0,1,Graduate,0,-0.631025,0.27828,2,3.0,-0.523950,1.796986
609,0,1,0,Not Graduate,0,-0.364782,0.27828,2,6.0,0.926581,0.027928
610,0,0,0,Graduate,0,0.021531,0.27828,1,7.0,0.707297,-1.229250
611,1,1,0,Not Graduate,0,-0.631025,0.27828,1,5.0,0.557857,-0.940629
612,1,1,1,Graduate,0,-0.631025,0.27828,1,1.0,-1.217211,1.751055